usevolt/uv_hal/uv_hal/inc/uv_gpio_lpc1785.h
/* 
 * This file is part of the uv_hal distribution (www.usevolt.fi).
 * Copyright (c) 2017 Usevolt Oy.
 * 
 * This program is free software: you can redistribute it and/or modify  
 * it under the terms of the GNU General Public License as published by  
 * the Free Software Foundation, version 3.
 *
 * This program is distributed in the hope that it will be useful, but 
 * WITHOUT ANY WARRANTY; without even the implied warranty of 
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU 
 * General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License 
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
*/

#ifndef UV_HAL_INC_UV_GPIO_LPC1785_H_
#define UV_HAL_INC_UV_GPIO_LPC1785_H_


#include <uv_hal_config.h>
#include <uv_utilities.h>


#if CONFIG_TARGET_LPC1785
#include "LPC177x_8x.h"


#define __TABLE81(value) (value & (~(1 << 8)))
#define __TABLE83(value) ((value & (~(1 << 5))) | (0b11 << 7))
#define __TABLE85(value) (0)
#define __TABLE87(value) (value & (~(1 << 9) | (1 << 8)))
#define __TABLE89(value) (value  | (1 << 7))


#define 	PIO0_0  	0
#define 	PIO0_1  	1
#define 	PIO0_2  	2
#define 	PIO0_3 		3
#define 	PIO0_4  	4
#define 	PIO0_5  	5
#define 	PIO0_6  	6
#define 	PIO0_7  	7
#define 	PIO0_8  	8
#define 	PIO0_9  	9
#define 	PIO0_10		10
#define 	PIO0_11		11
#define 	PIO0_12		12
#define 	PIO0_13		13
#define 	PIO0_14     14
#define 	PIO0_15     15
#define 	PIO0_16     16
#define 	PIO0_17     17
#define 	PIO0_18     18
#define 	PIO0_19     19
#define 	PIO0_20     20
#define 	PIO0_21     21
#define 	PIO0_22     22
#define 	PIO0_23     23
#define 	PIO0_24     24
#define 	PIO0_25     25
#define 	PIO0_26     26
#define 	PIO0_27     27
#define 	PIO0_28     28
#define 	PIO0_29     29
#define 	PIO0_30     30
#define 	PIO0_31     31
#define 	PIO1_0      32
#define 	PIO1_1      33
#define 	PIO1_2      34
#define 	PIO1_3      35
#define 	PIO1_4      36
#define 	PIO1_5      37
#define 	PIO1_6      38
#define 	PIO1_7      39
#define 	PIO1_8      40
#define 	PIO1_9      41
#define 	PIO1_10     42
#define 	PIO1_11     43
#define 	PIO1_12     44
#define 	PIO1_13     45
#define 	PIO1_14     46
#define 	PIO1_15     47
#define 	PIO1_16     48
#define 	PIO1_17     49
#define 	PIO1_18     50
#define 	PIO1_19     51
#define 	PIO1_20     52
#define 	PIO1_21     53
#define 	PIO1_22     54
#define 	PIO1_23     55
#define 	PIO1_24     56
#define 	PIO1_25     57
#define 	PIO1_26     58
#define 	PIO1_27     59
#define 	PIO1_28     60
#define 	PIO1_29     61
#define 	PIO1_30     62
#define 	PIO1_31     63
#define 	PIO2_0      64
#define 	PIO2_1      65
#define 	PIO2_2      66
#define 	PIO2_3      67
#define 	PIO2_4      68
#define 	PIO2_5      69
#define 	PIO2_6      70
#define 	PIO2_7      71
#define 	PIO2_8      72
#define 	PIO2_9      73
#define 	PIO2_10     74
#define 	PIO2_11     75
#define 	PIO2_12     76
#define 	PIO2_13     77
#define 	PIO2_14     78
#define 	PIO2_15     79
#define 	PIO2_16     80
#define 	PIO2_17     81
#define 	PIO2_18     82
#define 	PIO2_19     83
#define 	PIO2_20     84
#define 	PIO2_21     85
#define 	PIO2_22     86
#define 	PIO2_23     87
#define 	PIO2_24     88
#define 	PIO2_25     89
#define 	PIO2_26     90
#define 	PIO2_27     91
#define 	PIO2_28     92
#define 	PIO2_29     93
#define 	PIO2_30     94
#define 	PIO2_31     95
#define 	PIO3_0      96
#define 	PIO3_1      97
#define 	PIO3_2      98
#define 	PIO3_3      99
#define 	PIO3_4      100
#define 	PIO3_5      101
#define 	PIO3_6      102
#define 	PIO3_7      103
#define 	PIO3_8      104
#define 	PIO3_9      105
#define 	PIO3_10     106
#define 	PIO3_11     107
#define 	PIO3_12     108
#define 	PIO3_13     109
#define 	PIO3_14     110
#define 	PIO3_15     111
#define 	PIO3_16     112
#define 	PIO3_17     113
#define 	PIO3_18     114
#define 	PIO3_19     115
#define 	PIO3_20     116
#define 	PIO3_21     117
#define 	PIO3_22     118
#define 	PIO3_23     119
#define 	PIO3_24     120
#define 	PIO3_25     121
#define 	PIO3_26     122
#define 	PIO3_27     123
#define 	PIO3_28     124
#define 	PIO3_29     125
#define 	PIO3_30     126
#define 	PIO3_31     127
#define 	PIO4_0      128
#define 	PIO4_1      129
#define 	PIO4_2      130
#define 	PIO4_3      131
#define 	PIO4_4      132
#define 	PIO4_5      133
#define 	PIO4_6      134
#define 	PIO4_7      135
#define 	PIO4_8      136
#define 	PIO4_9      137
#define 	PIO4_10     138
#define 	PIO4_11     139
#define 	PIO4_12     140
#define 	PIO4_13     141
#define 	PIO4_14     142
#define 	PIO4_15     143
#define 	PIO4_16     144
#define 	PIO4_17     145
#define 	PIO4_18     146
#define 	PIO4_19     147
#define 	PIO4_20     148
#define 	PIO4_21     149
#define 	PIO4_22     150
#define 	PIO4_23     151
#define 	PIO4_24     152
#define 	PIO4_25     153
#define 	PIO4_26     154
#define 	PIO4_27     155
#define 	PIO4_28     156
#define 	PIO4_29     157
#define 	PIO4_30     158
#define 	PIO4_31     159
#define 	PIO5_0      160
#define 	PIO5_1      161
#define 	PIO5_2      162
#define 	PIO5_3      163
#define 	PIO5_4      164

typedef uint32_t uv_gpios_e;


#define port(port_num)			CAT(LPC_GPIO, port_num)


#define GPIO_0_port 			0
#define GPIO_0_config(value)	LPC_IOCON->P0_0 = __TABLE81(value)
#define GPIO_0_pin				0
#define GPIO_1_port 			0
#define GPIO_1_config(value)	LPC_IOCON->P0_1 = __TABLE81(value)
#define GPIO_1_pin				1
#define GPIO_2_port 			0
#define GPIO_2_config(value)	LPC_IOCON->P0_2 = __TABLE81(value)
#define GPIO_2_pin				2
#define GPIO_3_port 			0
#define GPIO_3_config(value)	LPC_IOCON->P0_3 = __TABLE81(value)
#define GPIO_3_pin				3
#define GPIO_4_port 			0
#define GPIO_4_config(value)	LPC_IOCON->P0_4 = __TABLE81(value)
#define GPIO_4_pin				4
#define GPIO_5_port 			0
#define GPIO_5_config(value)	LPC_IOCON->P0_5 = __TABLE81(value)
#define GPIO_5_pin				5
#define GPIO_6_port 			0
#define GPIO_6_config(value)	LPC_IOCON->P0_6 = __TABLE81(value)
#define GPIO_6_pin				6
#define GPIO_7_port 			0
#define GPIO_7_config(value)	LPC_IOCON->P0_7 = __TABLE89(value)
#define GPIO_7_pin				7
#define GPIO_8_port 			0
#define GPIO_8_config(value)	LPC_IOCON->P0_8 = __TABLE89(value)
#define GPIO_8_pin				8
#define GPIO_9_port 			0
#define GPIO_9_config(value)	LPC_IOCON->P0_9 = __TABLE89(value)
#define GPIO_9_pin				9
#define GPIO_10_port 			0
#define GPIO_10_config(value)	LPC_IOCON->P0_10 = __TABLE81(value)
#define GPIO_10_pin				10
#define GPIO_11_port 			0
#define GPIO_11_config(value)	LPC_IOCON->P0_11 = __TABLE81(value)
#define GPIO_11_pin				11
#define GPIO_12_port 			0
#define GPIO_12_config(value)	LPC_IOCON->P0_12 = __TABLE83(value)
#define GPIO_12_pin				12
#define GPIO_13_port 			0
#define GPIO_13_config(value)	LPC_IOCON->P0_13 = __TABLE83(value)
#define GPIO_13_pin				13
#define GPIO_14_port 			0
#define GPIO_14_config(value)	LPC_IOCON->P0_14 = __TABLE81(value)
#define GPIO_14_pin				14
#define GPIO_15_port 			0
#define GPIO_15_config(value)	LPC_IOCON->P0_15 = __TABLE81(value)
#define GPIO_15_pin				15
#define GPIO_16_port 			0
#define GPIO_16_config(value)	LPC_IOCON->P0_16 = __TABLE81(value)
#define GPIO_16_pin				16
#define GPIO_17_port 			0
#define GPIO_17_config(value)	LPC_IOCON->P0_17 = __TABLE81(value)
#define GPIO_17_pin				17
#define GPIO_18_port 			0
#define GPIO_18_config(value)	LPC_IOCON->P0_18 = __TABLE81(value)
#define GPIO_18_pin				18
#define GPIO_19_port 			0
#define GPIO_19_config(value)	LPC_IOCON->P0_19 = __TABLE81(value)
#define GPIO_19_pin				19
#define GPIO_20_port 			0
#define GPIO_20_config(value)	LPC_IOCON->P0_20 = __TABLE81(value)
#define GPIO_20_pin				20
#define GPIO_21_port 			0
#define GPIO_21_config(value)	LPC_IOCON->P0_21 = __TABLE81(value)
#define GPIO_21_pin				21
#define GPIO_22_port 			0
#define GPIO_22_config(value)	LPC_IOCON->P0_22 = __TABLE81(value)
#define GPIO_22_pin				22
#define GPIO_23_port 			0
#define GPIO_23_config(value)	LPC_IOCON->P0_23 = __TABLE83(value)
#define GPIO_23_pin				23
#define GPIO_24_port 			0
#define GPIO_24_config(value)	LPC_IOCON->P0_24 = __TABLE83(value)
#define GPIO_24_pin				24
#define GPIO_25_port 			0
#define GPIO_25_config(value)	LPC_IOCON->P0_25 = __TABLE83(value)
#define GPIO_25_pin				25
#define GPIO_26_port 			0
#define GPIO_26_config(value)	LPC_IOCON->P0_26 = __TABLE83(value)
#define GPIO_26_pin				26
#define GPIO_27_port 			0
#define GPIO_27_config(value)	LPC_IOCON->P0_27 = __TABLE87(value)
#define GPIO_27_pin				27
#define GPIO_28_port 			0
#define GPIO_28_config(value)	LPC_IOCON->P0_28 = __TABLE87(value)
#define GPIO_28_pin				28
#define GPIO_29_port 			0
#define GPIO_29_config(value)	LPC_IOCON->P0_29 = __TABLE85(value)
#define GPIO_29_pin				29
#define GPIO_30_port 			0
#define GPIO_30_config(value)	LPC_IOCON->P0_30 = __TABLE85(value)
#define GPIO_30_pin				30
#define GPIO_31_port 			0
#define GPIO_31_config(value)	LPC_IOCON->P0_31 = __TABLE85(value)
#define GPIO_31_pin				31




#define GPIO_32_port 			1
#define GPIO_32_config(value)	LPC_IOCON->P1_0 = __TABLE81(value)
#define GPIO_32_pin				0
#define GPIO_33_port 			1
#define GPIO_33_config(value)	LPC_IOCON->P1_1 = __TABLE81(value)
#define GPIO_33_pin				1
#define GPIO_34_port 			1
#define GPIO_34_config(value)	LPC_IOCON->P1_2 = __TABLE81(value)
#define GPIO_34_pin				2
#define GPIO_35_port 			1
#define GPIO_35_config(value)	LPC_IOCON->P1_3 = __TABLE81(value)
#define GPIO_35_pin				3
#define GPIO_36_port 			1
#define GPIO_36_config(value)	LPC_IOCON->P1_4 = __TABLE81(value)
#define GPIO_36_pin				4
#define GPIO_37_port 			1
#define GPIO_37_config(value)	LPC_IOCON->P1_5 = __TABLE89(value)
#define GPIO_37_pin				5
#define GPIO_38_port 			1
#define GPIO_38_config(value)	LPC_IOCON->P1_6 = __TABLE89(value)
#define GPIO_38_pin				6
#define GPIO_39_port 			1
#define GPIO_39_config(value)	LPC_IOCON->P1_7 = __TABLE89(value)
#define GPIO_39_pin				7
#define GPIO_40_port 			1
#define GPIO_40_config(value)	LPC_IOCON->P1_8 = __TABLE81(value)
#define GPIO_40_pin				8
#define GPIO_41_port 			1
#define GPIO_41_config(value)	LPC_IOCON->P1_9 = __TABLE81(value)
#define GPIO_41_pin				9
#define GPIO_42_port 			1
#define GPIO_42_config(value)	LPC_IOCON->P1_10 = __TABLE81(value)
#define GPIO_42_pin				10
#define GPIO_43_port 			1
#define GPIO_43_config(value)	LPC_IOCON->P1_11 = __TABLE81(value)
#define GPIO_43_pin				11
#define GPIO_44_port 			1
#define GPIO_44_config(value)	LPC_IOCON->P1_12 = __TABLE81(value)
#define GPIO_44_pin				12
#define GPIO_45_port 			1
#define GPIO_45_config(value)	LPC_IOCON->P1_13 = __TABLE81(value)
#define GPIO_45_pin				13
#define GPIO_46_port 			1
#define GPIO_46_config(value)	LPC_IOCON->P1_14 = __TABLE89(value)
#define GPIO_46_pin				14
#define GPIO_47_port 			1
#define GPIO_47_config(value)	LPC_IOCON->P1_15 = __TABLE81(value)
#define GPIO_47_pin				15
#define GPIO_48_port 			1
#define GPIO_48_config(value)	LPC_IOCON->P1_16 = __TABLE89(value)
#define GPIO_48_pin				16
#define GPIO_49_port 			1
#define GPIO_49_config(value)	LPC_IOCON->P1_17 = __TABLE89(value)
#define GPIO_49_pin				17
#define GPIO_50_port 			1
#define GPIO_50_config(value)	LPC_IOCON->P1_18 = __TABLE81(value)
#define GPIO_50_pin				18
#define GPIO_51_port 			1
#define GPIO_51_config(value)	LPC_IOCON->P1_19 = __TABLE81(value)
#define GPIO_51_pin				19
#define GPIO_52_port 			1
#define GPIO_52_config(value)	LPC_IOCON->P1_20 = __TABLE81(value)
#define GPIO_52_pin				20
#define GPIO_53_port 			1
#define GPIO_53_config(value)	LPC_IOCON->P1_21 = __TABLE81(value)
#define GPIO_53_pin				21
#define GPIO_54_port 			1
#define GPIO_54_config(value)	LPC_IOCON->P1_22 = __TABLE81(value)
#define GPIO_54_pin				22
#define GPIO_55_port 			1
#define GPIO_55_config(value)	LPC_IOCON->P1_23 = __TABLE81(value)
#define GPIO_55_pin				23
#define GPIO_56_port 			1
#define GPIO_56_config(value)	LPC_IOCON->P1_24 = __TABLE81(value)
#define GPIO_56_pin				24
#define GPIO_57_port 			1
#define GPIO_57_config(value)	LPC_IOCON->P1_25 = __TABLE81(value)
#define GPIO_57_pin				25
#define GPIO_58_port 			1
#define GPIO_58_config(value)	LPC_IOCON->P1_26 = __TABLE81(value)
#define GPIO_58_pin				26
#define GPIO_59_port 			1
#define GPIO_59_config(value)	LPC_IOCON->P1_27 = __TABLE81(value)
#define GPIO_59_pin				27
#define GPIO_60_port 			1
#define GPIO_60_config(value)	LPC_IOCON->P1_28 = __TABLE81(value)
#define GPIO_60_pin				28
#define GPIO_61_port 			1
#define GPIO_61_config(value)	LPC_IOCON->P1_29 = __TABLE81(value)
#define GPIO_61_pin				29
#define GPIO_62_port 			1
#define GPIO_62_config(value)	LPC_IOCON->P1_30 = __TABLE83(value)
#define GPIO_62_pin				30
#define GPIO_63_port 			1
#define GPIO_63_config(value)	LPC_IOCON->P1_31 = __TABLE83(value)
#define GPIO_63_pin				31




