usevolt/uv_hal/uv_hal/inc/uv_gpio_lpc1785.h
#define GPIO_64_port 			2
#define GPIO_64_config(value)	LPC_IOCON->P2_0 = __TABLE81(value)
#define GPIO_64_pin				0
#define GPIO_65_port 			2
#define GPIO_65_config(value)	LPC_IOCON->P2_1 = __TABLE81(value)
#define GPIO_65_pin				1
#define GPIO_66_port 			2
#define GPIO_66_config(value)	LPC_IOCON->P2_2 = __TABLE81(value)
#define GPIO_66_pin				2
#define GPIO_67_port 			2
#define GPIO_67_config(value)	LPC_IOCON->P2_3 = __TABLE81(value)
#define GPIO_67_pin				3
#define GPIO_68_port 			2
#define GPIO_68_config(value)	LPC_IOCON->P2_4 = __TABLE81(value)
#define GPIO_68_pin				4
#define GPIO_69_port 			2
#define GPIO_69_config(value)	LPC_IOCON->P2_5 = __TABLE81(value)
#define GPIO_69_pin				5
#define GPIO_70_port 			2
#define GPIO_70_config(value)	LPC_IOCON->P2_6 = __TABLE81(value)
#define GPIO_70_pin				6
#define GPIO_71_port 			2
#define GPIO_71_config(value)	LPC_IOCON->P2_7 = __TABLE81(value)
#define GPIO_71_pin				7
#define GPIO_72_port 			2
#define GPIO_72_config(value)	LPC_IOCON->P2_8 = __TABLE81(value)
#define GPIO_72_pin				8
#define GPIO_73_port 			2
#define GPIO_73_config(value)	LPC_IOCON->P2_9 = __TABLE81(value)
#define GPIO_73_pin				9
#define GPIO_74_port 			2
#define GPIO_74_config(value)	LPC_IOCON->P2_10 = __TABLE81(value)
#define GPIO_74_pin				10
#define GPIO_75_port 			2
#define GPIO_75_config(value)	LPC_IOCON->P2_11 = __TABLE81(value)
#define GPIO_75_pin				11
#define GPIO_76_port 			2
#define GPIO_76_config(value)	LPC_IOCON->P2_12 = __TABLE81(value)
#define GPIO_76_pin				12
#define GPIO_77_port 			2
#define GPIO_77_config(value)	LPC_IOCON->P2_13 = __TABLE81(value)
#define GPIO_77_pin				13
#define GPIO_78_port 			2
#define GPIO_78_config(value)	LPC_IOCON->P2_14 = __TABLE81(value)
#define GPIO_78_pin				14
#define GPIO_79_port 			2
#define GPIO_79_config(value)	LPC_IOCON->P2_15 = __TABLE81(value)
#define GPIO_79_pin				15
#define GPIO_80_port 			2
#define GPIO_80_config(value)	LPC_IOCON->P2_16 = __TABLE81(value)
#define GPIO_80_pin				16
#define GPIO_81_port 			2
#define GPIO_81_config(value)	LPC_IOCON->P2_17 = __TABLE81(value)
#define GPIO_81_pin				17
#define GPIO_82_port 			2
#define GPIO_82_config(value)	LPC_IOCON->P2_18 = __TABLE81(value)
#define GPIO_82_pin				18
#define GPIO_83_port 			2
#define GPIO_83_config(value)	LPC_IOCON->P2_19 = __TABLE81(value)
#define GPIO_83_pin				19
#define GPIO_84_port 			2
#define GPIO_84_config(value)	LPC_IOCON->P2_20 = __TABLE81(value)
#define GPIO_84_pin				20
#define GPIO_85_port 			2
#define GPIO_85_config(value)	LPC_IOCON->P2_21 = __TABLE81(value)
#define GPIO_85_pin				21
#define GPIO_86_port 			2
#define GPIO_86_config(value)	LPC_IOCON->P2_22 = __TABLE81(value)
#define GPIO_86_pin				22
#define GPIO_87_port 			2
#define GPIO_87_config(value)	LPC_IOCON->P2_23 = __TABLE81(value)
#define GPIO_87_pin				23
#define GPIO_88_port 			2
#define GPIO_88_config(value)	LPC_IOCON->P2_24 = __TABLE81(value)
#define GPIO_88_pin				24
#define GPIO_89_port 			2
#define GPIO_89_config(value)	LPC_IOCON->P2_25 = __TABLE81(value)
#define GPIO_89_pin				25
#define GPIO_90_port 			2
#define GPIO_90_config(value)	LPC_IOCON->P2_26 = __TABLE81(value)
#define GPIO_90_pin				26
#define GPIO_91_port 			2
#define GPIO_91_config(value)	LPC_IOCON->P2_27 = __TABLE81(value)
#define GPIO_91_pin				27
#define GPIO_92_port 			2
#define GPIO_92_config(value)	LPC_IOCON->P2_28 = __TABLE81(value)
#define GPIO_92_pin				28
#define GPIO_93_port 			2
#define GPIO_93_config(value)	LPC_IOCON->P2_29 = __TABLE81(value)
#define GPIO_93_pin				29
#define GPIO_94_port 			2
#define GPIO_94_config(value)	LPC_IOCON->P2_30 = __TABLE81(value)
#define GPIO_94_pin				30
#define GPIO_95_port 			2
#define GPIO_95_config(value)	LPC_IOCON->P2_31 = __TABLE81(value)
#define GPIO_95_pin				31





#define GPIO_96_port 			3
#define GPIO_96_config(value)	LPC_IOCON->P3_0 = __TABLE81(value)
#define GPIO_96_pin				0
#define GPIO_97_port 			3
#define GPIO_97_config(value)	LPC_IOCON->P3_1 = __TABLE81(value)
#define GPIO_97_pin				1
#define GPIO_98_port 			3
#define GPIO_98_config(value)	LPC_IOCON->P3_2 = __TABLE81(value)
#define GPIO_98_pin				2
#define GPIO_99_port 			3
#define GPIO_99_config(value)	LPC_IOCON->P3_3 = __TABLE81(value)
#define GPIO_99_pin				3
#define GPIO_100_port 			3
#define GPIO_100_config(value)	LPC_IOCON->P3_4 = __TABLE81(value)
#define GPIO_100_pin				4
#define GPIO_101_port 			3
#define GPIO_101_config(value)	LPC_IOCON->P3_5 = __TABLE81(value)
#define GPIO_101_pin				5
#define GPIO_102_port 			3
#define GPIO_102_config(value)	LPC_IOCON->P3_6 = __TABLE81(value)
#define GPIO_102_pin				6
#define GPIO_103_port 			3
#define GPIO_103_config(value)	LPC_IOCON->P3_7 = __TABLE81(value)
#define GPIO_103_pin				7
#define GPIO_104_port 			3
#define GPIO_104_config(value)	LPC_IOCON->P3_8 = __TABLE81(value)
#define GPIO_104_pin				8
#define GPIO_105_port 			3
#define GPIO_105_config(value)	LPC_IOCON->P3_9 = __TABLE81(value)
#define GPIO_105_pin				9
#define GPIO_106_port 			3
#define GPIO_106_config(value)	LPC_IOCON->P3_10 = __TABLE81(value)
#define GPIO_106_pin				10
#define GPIO_107_port 			3
#define GPIO_107_config(value)	LPC_IOCON->P3_11 = __TABLE81(value)
#define GPIO_107_pin				11
#define GPIO_108_port 			3
#define GPIO_108_config(value)	LPC_IOCON->P3_12 = __TABLE81(value)
#define GPIO_108_pin				12
#define GPIO_109_port 			3
#define GPIO_109_config(value)	LPC_IOCON->P3_13 = __TABLE81(value)
#define GPIO_109_pin				13
#define GPIO_110_port 			3
#define GPIO_110_config(value)	LPC_IOCON->P3_14 = __TABLE81(value)
#define GPIO_110_pin				14
#define GPIO_111_port 			3
#define GPIO_111_config(value)	LPC_IOCON->P3_15 = __TABLE81(value)
#define GPIO_111_pin				15
#define GPIO_112_port 			3
#define GPIO_112_config(value)	LPC_IOCON->P3_16 = __TABLE81(value)
#define GPIO_112_pin				16
#define GPIO_113_port 			3
#define GPIO_113_config(value)	LPC_IOCON->P3_17 = __TABLE81(value)
#define GPIO_113_pin				17
#define GPIO_114_port 			3
#define GPIO_114_config(value)	LPC_IOCON->P3_18 = __TABLE81(value)
#define GPIO_114_pin				18
#define GPIO_115_port 			3
#define GPIO_115_config(value)	LPC_IOCON->P3_19 = __TABLE81(value)
#define GPIO_115_pin				19
#define GPIO_116_port 			3
#define GPIO_116_config(value)	LPC_IOCON->P3_20 = __TABLE81(value)
#define GPIO_116_pin				20
#define GPIO_117_port 			3
#define GPIO_117_config(value)	LPC_IOCON->P3_21 = __TABLE81(value)
#define GPIO_117_pin				21
#define GPIO_118_port 			3
#define GPIO_118_config(value)	LPC_IOCON->P3_22 = __TABLE81(value)
#define GPIO_118_pin				22
#define GPIO_119_port 			3
#define GPIO_119_config(value)	LPC_IOCON->P3_23 = __TABLE81(value)
#define GPIO_119_pin				23
#define GPIO_120_port 			3
#define GPIO_120_config(value)	LPC_IOCON->P3_24 = __TABLE81(value)
#define GPIO_120_pin				24
#define GPIO_121_port 			3
#define GPIO_121_config(value)	LPC_IOCON->P3_25 = __TABLE81(value)
#define GPIO_121_pin				25
#define GPIO_122_port 			3
#define GPIO_122_config(value)	LPC_IOCON->P3_26 = __TABLE81(value)
#define GPIO_122_pin				26
#define GPIO_123_port 			3
#define GPIO_123_config(value)	LPC_IOCON->P3_27 = __TABLE81(value)
#define GPIO_123_pin				27
#define GPIO_124_port 			3
#define GPIO_124_config(value)	LPC_IOCON->P3_28 = __TABLE81(value)
#define GPIO_124_pin				28
#define GPIO_125_port 			3
#define GPIO_125_config(value)	LPC_IOCON->P3_29 = __TABLE81(value)
#define GPIO_125_pin				29
#define GPIO_126_port 			3
#define GPIO_126_config(value)	LPC_IOCON->P3_30 = __TABLE81(value)
#define GPIO_126_pin				30
#define GPIO_127_port 			3
#define GPIO_127_config(value)	LPC_IOCON->P3_31 = __TABLE81(value)
#define GPIO_127_pin				31






#define GPIO_128_port 			4
#define GPIO_128_config(value)	LPC_IOCON->P4_0 = __TABLE81(value)
#define GPIO_128_pin				0
#define GPIO_129_port 			4
#define GPIO_129_config(value)	LPC_IOCON->P4_1 = __TABLE81(value)
#define GPIO_129_pin				1
#define GPIO_130_port 			4
#define GPIO_130_config(value)	LPC_IOCON->P4_2 = __TABLE81(value)
#define GPIO_130_pin				2
#define GPIO_131_port 			4
#define GPIO_131_config(value)	LPC_IOCON->P4_3 = __TABLE81(value)
#define GPIO_131_pin				3
#define GPIO_132_port 			4
#define GPIO_132_config(value)	LPC_IOCON->P4_4 = __TABLE81(value)
#define GPIO_132_pin				4
#define GPIO_133_port 			4
#define GPIO_133_config(value)	LPC_IOCON->P4_5 = __TABLE81(value)
#define GPIO_133_pin				5
#define GPIO_134_port 			4
#define GPIO_134_config(value)	LPC_IOCON->P4_6 = __TABLE81(value)
#define GPIO_134_pin				6
#define GPIO_135_port 			4
#define GPIO_135_config(value)	LPC_IOCON->P4_7 = __TABLE81(value)
#define GPIO_135_pin				7
#define GPIO_136_port 			4
#define GPIO_136_config(value)	LPC_IOCON->P4_8 = __TABLE81(value)
#define GPIO_136_pin				8
#define GPIO_137_port 			4
#define GPIO_137_config(value)	LPC_IOCON->P4_9 = __TABLE81(value)
#define GPIO_137_pin				9
#define GPIO_138_port 			4
#define GPIO_138_config(value)	LPC_IOCON->P4_10 = __TABLE81(value)
#define GPIO_138_pin				10
#define GPIO_139_port 			4
#define GPIO_139_config(value)	LPC_IOCON->P4_11 = __TABLE81(value)
#define GPIO_139_pin				11
#define GPIO_140_port 			4
#define GPIO_140_config(value)	LPC_IOCON->P4_12 = __TABLE81(value)
#define GPIO_140_pin				12
#define GPIO_141_port 			4
#define GPIO_141_config(value)	LPC_IOCON->P4_13 = __TABLE81(value)
#define GPIO_141_pin				13
#define GPIO_142_port 			4
#define GPIO_142_config(value)	LPC_IOCON->P4_14 = __TABLE81(value)
#define GPIO_142_pin				14
#define GPIO_143_port 			4
#define GPIO_143_config(value)	LPC_IOCON->P4_15 = __TABLE81(value)
#define GPIO_143_pin				15
#define GPIO_144_port 			4
#define GPIO_144_config(value)	LPC_IOCON->P4_16 = __TABLE81(value)
#define GPIO_144_pin				16
#define GPIO_145_port 			4
#define GPIO_145_config(value)	LPC_IOCON->P4_17 = __TABLE81(value)
#define GPIO_145_pin				17
#define GPIO_146_port 			4
#define GPIO_146_config(value)	LPC_IOCON->P4_18 = __TABLE81(value)
#define GPIO_146_pin				18
#define GPIO_147_port 			4
#define GPIO_147_config(value)	LPC_IOCON->P4_19 = __TABLE81(value)
#define GPIO_147_pin				19
#define GPIO_148_port 			4
#define GPIO_148_config(value)	LPC_IOCON->P4_20 = __TABLE81(value)
#define GPIO_148_pin				20
#define GPIO_149_port 			4
#define GPIO_149_config(value)	LPC_IOCON->P4_21 = __TABLE81(value)
#define GPIO_149_pin				21
#define GPIO_150_port 			4
#define GPIO_150_config(value)	LPC_IOCON->P4_22 = __TABLE81(value)
#define GPIO_150_pin				22
#define GPIO_151_port 			4
#define GPIO_151_config(value)	LPC_IOCON->P4_23 = __TABLE81(value)
#define GPIO_151_pin				23
#define GPIO_152_port 			4
#define GPIO_152_config(value)	LPC_IOCON->P4_24 = __TABLE81(value)
#define GPIO_152_pin				24
#define GPIO_153_port 			4
#define GPIO_153_config(value)	LPC_IOCON->P4_25 = __TABLE81(value)
#define GPIO_153_pin				25
#define GPIO_154_port 			4
#define GPIO_154_config(value)	LPC_IOCON->P4_26 = __TABLE81(value)
#define GPIO_154_pin				26
#define GPIO_155_port 			4
#define GPIO_155_config(value)	LPC_IOCON->P4_27 = __TABLE81(value)
#define GPIO_155_pin				27
#define GPIO_156_port 			4
#define GPIO_156_config(value)	LPC_IOCON->P4_28 = __TABLE81(value)
#define GPIO_156_pin				28
#define GPIO_157_port 			4
#define GPIO_157_config(value)	LPC_IOCON->P4_29 = __TABLE81(value)
#define GPIO_157_pin				29
#define GPIO_158_port 			4
#define GPIO_158_config(value)	LPC_IOCON->P4_30 = __TABLE81(value)
#define GPIO_158_pin				30
#define GPIO_159_port 			4
#define GPIO_159_config(value)	LPC_IOCON->P4_31 = __TABLE81(value)
#define GPIO_159_pin				31







#define GPIO_160_port 			5
#define GPIO_160_config(value)	LPC_IOCON->P5_0 = __TABLE81(value)
#define GPIO_160_pin				0
#define GPIO_161_port 			5
#define GPIO_161_config(value)	LPC_IOCON->P5_1 = __TABLE81(value)
#define GPIO_161_pin				1
#define GPIO_162_port 			5
#define GPIO_162_config(value)	LPC_IOCON->P5_2 = __TABLE87(value)
#define GPIO_162_pin				2
#define GPIO_163_port 			5
#define GPIO_163_config(value)	LPC_IOCON->P5_3 = __TABLE87(value)
#define GPIO_163_pin				3
#define GPIO_164_port 			5
#define GPIO_164_config(value)	LPC_IOCON->P5_4 = __TABLE81(value)
#define GPIO_164_pin				4


#endif


#endif /* UV_HAL_INC_UV_GPIO_LPC1785_H_ */
